Revit 2027 API
AnalyticalLink.OwnerId Property
 ElementId of Analytical Element which created the AnalyticalLink (if any) invalidElementId if this Analytical Link was created by the User or API
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OwnerId { get; }
Public ReadOnly Property OwnerId As ElementId
	Get
public:
property ElementId^ OwnerId {
	ElementId^ get ();
}
member OwnerId : ElementId with get
Property Value
ElementId
See Also
Reference
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace